       program-id. Program1.
       working-storage section.
       01 MyFirstStorageItem       pic x(10).
       procedure division.
           
           goback.

       end program Program1.
