       *>> <summary>issue189 is naff class
       *>> <para>with a wicked paragraph</para>
       *>>
       *>> </summary>
       class-id issue189 public.

       method-id new public.
       working-storage section.
       01 ws-item               pic x(10).
       procedure division.

           exit method.
       end method.

       end class.
