      *>**
      *>  Short sample.
      *>  @author Bruno Pacheco (https://brunopacheco1.github.io/)
      *>  @license LGPL-3.0
      *>**
       program-id. sample.
       working-storage section.
       01 ws-item               pic x(10).
       procedure division.
