       program-id. test.

       environment division.
       configuration section.

       data division.
       working-storage section.
       01 ws-item                       pic x(10).

       procedure division.
       first-para.
       second section.

           goback.

       end program test.
