       program-id. test.

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.

           goback.

       end program test.
